Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttribute.Extrusion Property
 The extrusion vector.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Extrusion { get; }
Public ReadOnly Property Extrusion As Vector
	Get
Property Value
Type: Vector
See Also
Reference
ReferenceModelObjectAttribute Class
Tekla.Structures.Model.Collaboration Namespace